import 'mosque_type.dart';

class MosqueTypes {
  static const musalla = MosqueType(
    id: 'musalla',
    nameAr: 'مصلى',
    descriptionAr: '''ﻓﻠﺴﻔﺔ اﻟﺘﺼﻤﻴﻢ: اﻟﺘﺮﻛﻴﺰ ﻋﻠﻰ "اﻟﻌﺒﺎدة اﻟﻤﺤﻀﺔ" دون ﺗﻌﻘﻴﺪات إﻧﺸﺎﺋﻴﺔ.
اﻟﻬﻮﻳﺔ اﻟﺒﺼﺮﻳﺔ ﻫﻨﺎ ﺗﻌﺘﻤﺪ ﻣﺒﺪأ "اﻟﺤﺪ اﻷدﻧﻰ"
اﻟﺴﻌﺔ: 50 إﻟﻰ 100 ﻣﺼﻞ ٍ .
اﻟﻘﺒﺔ: ﻻ ﺗﻮﺟﺪ (ﺳﻘﻒ ﻣﺴﺘﻮ ٍ).
اﻟﻤﺌﺬﻧﺔ: ﻣﺌﺬﻧﺔ ﻗﺼﻴﺮة ﻣﺮﺑﻮﻃﺔ ﺑﺎﻟﻤﺼﻠﻰ (ﺣﻮاﻟﻲ 11 م).
اﻟﻤﺤﺮاب: ﺗﺠﻮﻳﻒ ﺑﺴﻴﻂ ﻓﻲ اﻟﺠﺪار أو ﺗﻤﻴﻴﺰ ﺑﺎﻟﻤﻮاد (ﻣﺜﻞ اﻟﺤﺠﺮ أو اﻟﻄﻮب).
اﻟﻮاﺟﻬﺔ: اﺳﺘﺨﺪام اﻟﻄﻮب أو اﻷﺳﻤﻨﺖ اﻷﺑﻴﺾ (وﻓﻘﺎً ﻟـ "ﻟﻮﺣﺔ اﻷﻟﻮان" ﻓﻲ اﻟﻜﺘﺎب: أﺑﻴﺾ ﻛﻠﺴﻲ).
اﻟﺼﻮﺗﻴﺎت: ﻧﻈﺎم ﺻﻮﺗﻲ ﻣﻨﺰﻟﻲ ﺑﺴﻴﻂ (ﺳﻤﺎﻋﺔ داﺧﻠﻴﺔ واﺣﺪة).
    ''',
    imageUrl: 'assets/images/musalla.jpeg',
  );

  static const small = MosqueType(
    id: 'small',
    nameAr: 'مسجد صغير',
    descriptionAr: '''ﻓﻠﺴﻔﺔ اﻟﺘﺼﻤﻴﻢ: اﻻﻧﺘﻘﺎل ﻣﻦ اﻟﻤﺼﻠﻰ إﻟﻰ اﻟﻤﺴﺠﺪ. إﺿﺎﻓﺔ وﻇﻴﻔﺔ اﻟﺨﻄﺒﺔ (ﺟﻤﻌﺔ ﻣﺤﺪودة) واﻟﺘﻌﻠﻴﻢ اﻷﺳﺎﺳﻲ.
اﻟﺴﻌﺔ: 150 إﻟﻰ 300 ﻣﺼﻞ ٍ .
اﻟﻘﺒﺔ: ﻗﺒﺔ ﻣﺮﻛﺰﻳﺔ ﺻﻐﻴﺮة (ﻗﻄﺮ 4 - 6 م) ﻣﺤﻤﻮﻟﺔ ﻋﻠﻰ رﻗﺒﺔ ﻗﺼﻴﺮة (رﻣﺰﻳﺔ).
اﻟﻤﺌﺬﻧﺔ: ﻣﺌﺬﻧﺔ ﻗﺼﻴﺮة (ﺣﻮاﻟﻲ 15 م). اﻟﺸﻜﻞ اﻟﻤﻘﺘﺮح ﻓﻲ اﻟﻜﺘﺎب: "ﻣﺮﺑﻌﺔ ﺷﺎﻣﻴﺔ" أو ﻣﻀﻠﻌﺔ ﺑﺴﻴﻄﺔ.
اﻟﻤﺤﺮاب: ﻣﺤﺮاب ﻣﺰﻳﻦ ﺑﺨﻂ "اﻟﺜﻠﺚ" وﻛﺎﺷﻲ ﻣﺤﺪود (ﻓﻴﺮوزي دﻣﺸﻘﻲ).
اﻟﺼﻮﺗﻴﺎت: اﺳﺘﺨﺪام ﻣﻮاد ﻣﺎﺻﺔ ﻟﻠﺼﻮت ﻓﻲ اﻟﺠﺪران اﻟﺨﻠﻔﻴﺔ ﻟﻤﻨﻊ اﻟﺼﺪى (ﻧﻈﺮاً ﻟﺼﻐﺮ اﻟﺤﺠﻢ وﺳﺮﻋﺔ ارﺗﺪاد اﻟﺼﻮت).
    ''',
    imageUrl: 'assets/images/small.jpg',
  );

  static const medium = MosqueType(
    id: 'medium',
    nameAr: 'مسجد متوسط',
    descriptionAr: '''ﻓﻠﺴﻔﺔ اﻟﺘﺼﻤﻴﻢ: اﻟﻤﺴﺠﺪ ﻛﻤﺮﻛﺰ اﺟﺘﻤﺎﻋﻲ. ﻳﻀﻢ ﻣﻜﺘﺒﺔ، ﻓﺼﻮل دراﺳﻴﺔ، وﺻﺤﻨﺎً .
اﻟﺴﻌﺔ: 500 إﻟﻰ 700 ﻣﺼﻞ ٍ .
اﻟﻘﺒﺔ: ﻗﺒﺔ ﻣﺘﻮﺳﻄﺔ (ﻗﻄﺮ 8 - 10 م) ﻣﻔﺘﻮﺣﺔ ﻣﻦ اﻟﺪاﺧﻞ (Void) وﺗﻌﻤﻞ ﻛﻤﻨﻮر ﺳﻤﺎوي.
اﻟﻤﺌﺬﻧﺔ: ﻣﺌﺬﻧﺔ ﻣﺘﻮﺳﻄﺔ ﺑﺎرﺗﻔﺎع 17 م. ﺑﺪن اﻟﻤﺌﺬﻧﺔ ﻳﺤﻮي زﺧﺎرف ﺣﺠﺮﻳﺔ أو ﻃﻮﺑﻴﺔ.
اﻟﻤﺪﺧﻞ: ﺑﻮاﺑﺔ ﻣﻤﻴﺰة وﻣﺮﺣﺒﺔ ﻣﻊ ﺧﻂ ﻛﻮﻓﻲ ﺑﻨﺎﺋﻲ.
اﻷﻟﻮان: ﻣﺰﻳﺞ ﻣﻦ اﻟﺤﺠﺮ اﻟﻜﺮﻳﻤﻲ/اﻟﻌﻈﻤﻲ ﻣﻊ ﺗﻔﺎﺻﻴﻞ ﺧﺸﺒﻴﺔ (وﻓﻖ ﻟﻮﺣﺔ اﻷﻟﻮان اﻟﻤﻘﺘﺮﺣﺔ).
اﻟﻬﻮﻳﺔ اﻹدارﻳﺔ: ﺗﺨﺼﻴﺺ ﻏﺮﻓﺔ ﻟـ "ﻟﺠﻨﺔ اﻟﻤﺴﺠﺪ".
    ''',
    imageUrl: 'assets/images/medium.jpg',
  );

  static const large = MosqueType(
    id: 'large',
    nameAr: 'مسجد كبير',
    descriptionAr: '''ﻓﻠﺴﻔﺔ اﻟﺘﺼﻤﻴﻢ: اﻟﻤﺴﺠﺪ ﻛـ "ﻋﻼﻣﺔ ﺣﻀﺮﻳﺔ" وﻗﻄﺐ ﺛﻘﺎﻓﻲ. إﺣﻴﺎء ﻣﻔﻬﻮم "اﻟﻤﺠﻤﻊ" .
اﻟﺴﻌﺔ: 1000 إﻟﻰ 1500+ ﻣﺼﻞ ٍ .
اﻟﻘﺒﺔ: ﻗﺒﺔ ﻣﺮﻛﺰﻳﺔ ﺿﺨﻤﺔ أو ﻧﻈﺎم ﻣﺘﻌﺪد اﻟﻘﺒﺎب.
اﻟﻤﺌﺬﻧﺔ: ﺑﺎرﺗﻔﺎع 27 م. ﺷﻜﻞ "ﻗﻠﻤﻲ" أو "ﻣﺮﺑﻊ" ﻣﻊ ﺷﺮﻓﺎت ﻟﻠﻤﺆذن.
اﻹﺿﺎءة: ﺗﺼﻤﻴﻢ اﻹﺿﺎءة اﻟﻨﻬﺎرﻳﺔ (Daylighting) ﻋﺒﺮ ﻧﻮاﻓﺬ رﻗﺒﺔ اﻟﻘﺒﺔ ﻹﺿﻔﺎء ﻃﺎﺑﻊ روﺣﺎﻧﻲ.
اﻟﺼﻮﺗﻴﺎت: ﺗﺼﻤﻴﻢ ﺻﻮﺗﻲ ﻫﻨﺪﺳﻲ ﻣﺘﺨﺼﺺ (Acoustic Design)؛ ﺷﻜﻞ اﻟﻘﺒﺔ واﻟﺠﺪران ﻳﺠﺐ أن ﻳﻮزع اﻟﺼﻮت ﺑﺸﻜﻞ ﻃﺒﻴﻌﻲ.
    ''',
    imageUrl: 'assets/images/large.jpg',
  );

  static const expansion = MosqueType(
    id: 'expansion',
    nameAr: 'توسعة',
    descriptionAr: "",
    imageUrl: 'assets/images/expansion.jpg',
  );

  static const all = [musalla, small, medium, large, expansion];
}